In [85]:
import pandas as pd

In [99]:
df=pd.read_excel('./Datasets/melt.xlsx')
df=pd.DataFrame(df)
df

    Name  2021-08-10 00:00:00  2021-08-11 00:00:00
0   Hina                 5000                 3000
1  Maria                 3300                 4000
2  Alice                 2000                 8900
3  Haris                 8000                 6700

In [100]:
df.columns=['Name','2021-08-10','2021-08-11']

In [101]:
df

    Name  2021-08-10  2021-08-11
0   Hina        5000        3000
1  Maria        3300        4000
2  Alice        2000        8900
3  Haris        8000        6700

## melt

In [98]:
pd.melt(df, id_vars=['Name'], value_vars=['2021-08-10'])

    Name    variable  value
0   Hina  2021-08-10   5000
1  Maria  2021-08-10   3300
2  Alice  2021-08-10   2000
3  Haris  2021-08-10   8000

In [15]:
pd.melt(df, id_vars=['Name'], value_vars=['2021-08-10','2021-08-11'],var_name='Date', value_name='Bill')

    Name        Date  Bill
0   Hina  2021-08-10  5000
1  Maria  2021-08-10  3300
2  Alice  2021-08-10  2000
3  Haris  2021-08-10  8000
4   Hina  2021-08-11  3000
5  Maria  2021-08-11  4000
6  Alice  2021-08-11  8900
7  Haris  2021-08-11  6700

## Concat

In [102]:
dfa=pd.read_excel('./Datasets/B.xlsx')
dfa=pd.DataFrame(dfa)
dfa

    Name          Disease
0  Ahmad         Diabatic
1   Nida  Iron Deficiency

In [103]:
dfb=pd.read_excel('./Datasets/D.xlsx')
dfb=pd.DataFrame(dfb)
dfb

    Name  Disease
0  Anaya  Kidney

In [105]:
pd.concat([dfa,dfb])

    Name          Disease
0  Ahmad         Diabatic
1   Nida  Iron Deficiency
0  Anaya          Kidney